# 出发城市
departure_cities = [
    # A
    '阿坝', '阿克苏', '安庆', '鞍山', '安顺', '安阳',
    # B
    '百色', '保定', '宝鸡', '保山', '包头', '北海', '北京', '蚌埠', '本溪', '毕节', '滨州',
    # C
    '沧州', '长白山', '长春', '常德', '昌都', '长沙', '长治', '常州', '巢湖', '潮州', '承德', '成都', '郴州', '赤峰', '池州', '重庆',
    '滁州',
    # D
    '大理', '大连', '丹东', '大庆', '大同', '大兴', '安岭', '达州', '德阳', '德州', '东方', '东莞', '东营',
    # E
    '鄂尔多斯', '恩施', '鄂州',
    # F
    '防城港', '佛山', '抚顺', '阜新', '阜阳', '福州', '抚州',
    # G
    '赣州', '广安', '广元', '广州', '贵港', '桂林', '贵阳', '果洛藏族自治州', '固原',
    # H
    '哈尔滨', '海北藏族自治州', '海东', '海口', '海西蒙古族藏族自治州', '邯郸', '杭州', '汉中', '亳州', '鹤壁', '合肥', '鹤岗', '黑河',
    '衡水', '衡阳', '河源', '菏泽', '淮安', '淮北', '怀化', '淮南', '黄冈', '黄南藏族自治州', '黄山', '黄石', '呼和浩特', '惠州',
    '葫芦岛', '呼伦贝尔', '湖州',
    # J
    '佳木斯', '吉安', '江门', '焦作', '嘉兴', '嘉峪关', '揭阳', '吉林', '济南', '金昌', '晋城', '景德镇', '荆门', '荆州', '金华',
    '济宁', '晋中', '锦州', '九江', '酒泉', '鸡西', '济源',
    # K
    '开封', '喀什', '克拉玛依', '昆明',
    # L
    '来宾', '莱芜', '廊坊', '兰州', '拉萨', '乐山', '连云港', '聊城', '辽阳', '辽源', '丽江', '临汾',
    '临沂', '丽水', '六安', '六盘水', '柳州', '龙岩', '娄底', '漯河', '洛阳', '泸州', '吕梁',
    # M
    '马鞍山', '茂名', '眉山', '梅州', '绵阳', '牡丹江',
    # N
    '南昌', '南充', '南京', '南宁', '南平', '南通', '南阳', '内江', '宁波', '宁德',
    # P
    '盘锦', '攀枝花', '平顶山', '萍乡', '普洱', '莆田', '濮阳',
    # Q
    '青岛', '庆阳', '清远', '秦皇岛', '钦州', '齐齐哈尔', '七台河', '泉州', '曲靖', '衢州',
    # R
    '日照',
    # S
    '三门峡', '三明', '三亚', '上海', '商丘', '上饶', '汕头', '汕尾', '韶关', '绍兴', '邵阳', '沈阳', '深圳', '石河子', '石家庄',
    '十堰', '石嘴山', '双鸭山', '朔州', '四平', '松原', '绥化', '遂宁', '随州', '宿迁', '苏州', '宿州',
    # T
    '泰安', '太原', '台州', '泰州', '唐山', '天津', '天门', '天水', '铁岭', '通化', '通辽', '铜陵', '铜仁',
    # W
    '潍坊', '威海', '渭南', '温州', '乌海', '武汉', '芜湖', '乌兰察布',
    '乌鲁木齐', '武威', '无锡', '吴忠', '梧州',
    # X
    '厦门', '西安', '湘潭', '襄阳', '咸宁', '仙桃', '咸阳', '孝感', '兴城', '邢台', '西宁', '新乡', '信阳', '新余',
    '忻州', '西双版纳', '宣城', '许昌', '徐州',
    # Y
    '延安', '延边朝鲜族自治州', '盐城', '阳泉', '扬州', '烟台', '宜宾', '宜昌', '伊春', '宜春', '银川', '营口', '鹰潭',
    '益阳', '永州', '岳阳', '玉林', '榆林', '运城', '云浮', '玉树藏族自治州', '玉溪',
    # Z
    '枣庄', '张家界', '张家口', '张掖', '漳州', '湛江', '肇庆', '昭通', '郑州',
    '镇江', '中山', '中卫', '周口', '舟山', '珠海', '驻马店', '株洲', '淄博', '自贡', '资阳', '遵义'
]

# 目的地
destinations = [
    # 云南
    '丽江', '西双版纳', '大理', '泸沽湖', '香格里拉', '腾冲', '瑞丽', '玉龙雪山', '昆明',
    # 海南
    '海口', '三亚', '博鳌', '蜈支洲', '天涯海角', '呀诺达', '槟榔谷', '亚龙湾', '大东海', '三亚湾',
    # 福建
    '厦门', '曾厝垵', '环岛路', '鼓浪屿', '胡里山炮台', '福州', '武夷山', '土楼', '成都', '九寨沟', '熊猫基地', '峨眉山', '乐山',
    '黄龙', '都江堰', '青城山', '稻城亚丁', '若尔盖', '四姑娘山',
    # 华东
    '迪士尼', '杭州', '苏州', '南京', '上海', '无锡', '扬州', '乌镇', '周庄', '西塘', '灵山大佛', '千岛湖', '宁波',
    # 广西
    '桂林', '阳朔', '北海', '龙脊梯田', '印象刘三姐', '南宁', '漓江', '银子岩', '象鼻山', '遇龙河', '芦笛岩', '世外桃源',
    # 华北
    '北京', '故宫', '颐和园', '八达岭', '北戴河', '秦皇岛', '承德', '乌兰布统', '坝上草原', '天津', '木兰围场',
    # 湖南
    '张家界', '天门山', '凤凰', '长沙', '韶山', '猛洞河漂流', '玻璃栈道', '崀山', '玻璃桥',
    # 陕西
    '兵马俑', '华山', '法门寺', '华清池', '明城墙', '钟鼓楼', '大雁塔', '陕西历史博物馆', '延安', '壶口瀑布', '乾陵',
    # 山东
    '青岛', '烟台', '济南', '泰山', '崂山', '蓬莱', '威海', '曲阜', '日照',
    # 西藏
    '拉萨', '布达拉宫', '大昭寺', '林芝', '日喀则', '纳木错', '羊卓雍错', '雅鲁藏布大峡谷', '珠峰', '山南',
    # 安徽
    '黄山', '九华山', '宏村', '屯溪', '西递',
    # 广东
    '广州', '珠海', '长隆', '深圳', '海陵岛', '巽寮湾',
    # 贵州
    '黄果树瀑布', '小七孔', '西江苗寨', '镇远', '梵净山', '万峰林', '赤水', '遵义', '大七孔', '马岭河',
    # 新疆
    '吐鲁番', '天山天池', '乌鲁木齐', '喀纳斯', '巴音布鲁克草原', '那拉提草原', '可可托海', '赛里木湖',
    # 河南
    '少林寺', '龙门石窟', '白马寺', '包公祠', '云台山', '清明上河园', '郭亮村', '万仙山',
    # 西北
    '敦煌', '嘉峪关', '莫高窟', '西宁', '青海湖', '兰州', '宁夏', '茶卡盐湖', '门源', '鸣沙山月牙泉', '张掖', '塔尔寺',
    # 重庆
    '武隆', '仙女山', '三峡', '龙水峡地缝',
    # 湖北
    '武汉', '三峡', '神农架', '武当山', '宜昌', '恩施',
    # 江西
    '庐山', '井冈山', '三清山', '龙虎山', '婺源', '景德镇',
    # 山西
    '平遥古城', '乔家大院', '五台山', '壶口瀑布', '王家大院', '云冈石窟', '雁门关', '晋祠',
    # 内蒙古
    '呼伦贝尔', '鄂尔多斯', '呼和浩特', '赤峰', '呼伦湖', '希拉穆仁', '响沙湾', '满洲里', '额尔古纳', '阿尔山',
    # 东北
    '长白山', '哈尔滨', '大连', '长春', '吉林', '沈阳', '漠河', '北极村', '五大连池', '镜泊湖', '扎龙'
]

# 产品类型
props = {"1": "跟团游", "3": "自由行", "5": "目的地参团"}
